book_lister_backend_api/app/controllers/reviews_controller.rb

    def show
        review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]