app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        list = List.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "lists" SET "name" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["name", "Bubba"], ["updated_at", "2020-02-14 00:08:27.386014"], ["id", 1]]
---
    def update
        list = List.find(params[:id])
        authorize_user_resource(list)
        list.update(list_params)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def destroy
        list = List.find(params[:id])